app/Controllers/UserController.php

INSERT INTO "library" ("idmovie", "iduser") VALUES (349425, '4')
---
    function addMovieInLibrary(){

        if(!Filter::verifyAuth($this->request, $this->response)){

            $this->response->setContentType("application/json");
            return $this->response->setJSON(["stateResult" =>false, "inf" =>  '', "url" => BASE_URL."api/1.0/views/login"]);

        }

        log_message('info',$this->request->getJSON()->idMovie);

        $permisos = $this->request->getCookie("permiso");
        $Session = TokenSession::decodeToken($permisos);

        $idMovie = $this->request->getJSON()->idMovie;
        $idUser = $Session["id"];

        $library = new Library();

        if($library->existenceOfCombination($idMovie,$idUser) == 0){

            $library->insert([
                'idmovie' => $idMovie,
                'iduser'  => $idUser,
            ]);

DELETE FROM "library"
WHERE "iduser" = '4'
AND "idmovie" = '501235'
---
    function removeMovieInLibrary(){

        if(!Filter::verifyAuth($this->request, $this->response)){

            $this->response->setContentType("application/json");
            return $this->response->setJSON(["stateResult" =>false, "inf" =>  '', "url" => BASE_URL."api/1.0/views/login"]);

        }

        $permisos = $this->request->getCookie("permiso");
        $Session = TokenSession::decodeToken($permisos);
        $idAccount = $Session["id"];

        $movie = $this->request->getVar("idMovie");

        $library = new Library();
        $library->where('iduser', $idAccount)->where('idmovie', $movie)->delete();