app/Models/Library.php

    public function getIdMovies(int $idUser) : array {

        $query = $this->db->table('library')
                ->select('idmovie')
                ->where('iduser', $idUser)
                ->get();
---
SELECT "idmovie"
FROM "library"
WHERE "iduser" = 4

    public function existenceOfCombination(int $idMovie, int $idUser) : int{
        $query = $this->db->table('library')
                ->select('iduser')
                ->where('idmovie', $idMovie)
                ->where('iduser', $idUser)
                ->get();
---
SELECT "iduser"
FROM "library"
WHERE "idmovie" = 349425
AND "iduser" = 4